import os

BASE_DIR = os.path.dirname(os.path.abspath(__file__))


text_help = '''Доступные команды:
/start
/author
/text
/photo
/list
/song
'''


text_author = 'HOODRICHSWOPER - RED FLAG\n <tg-spoiler>на всех площадках</tg-spoiler>'


alf = '1234567890qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM'

helo = '''Wassup, бро!!! 👋🔥
Тебе салютует мой real trapoholick бот,
а я - начинающий артист и музыкант HOODRICHSWOPER,
но можешь звать просто - Свопер 😎

В этом канале ты найдёшь информацию о моём творчестве,
хотя совсем скоро искать её уже не понадобится -
все и так будут видеть меня
на афишах, в чартах и в своих плейлистах 🎧🚀

Удачки, брачо!
Береги себя и слушай хорошую музыку 💿✨
https://band.link/GLILH 

HOODRICHSWOPER'''

text_song_INDUSTRIA = """ИНДУСТРИЯ
всё ещё один я не победим 
не крашеный ублюдок я с рождения блондин
не пытайся подражать мне я не повторим кретин
****ый laim, колхозник, паль хокаге аладин
не хочу я больше жить не надо мне 21
я хочу *шить в 19 * и ** 
чтоб запомниться моей родне чтоб
знали я критин
видно по глазам homeless
хоть не бываю я один
"""
img_INDUSTRIA = os.path.join(BASE_DIR, 'files', 'img' , 'dexter.jpg')


text_song_RED_FLAG = """"зачем ты плачешь зай лучше б думала тогда
каждая подруга говорила то что я рэд флаг
ну и все подруги говорили типа я мудак
и не скрыть мне в телефоне номера всех этих баб

я не хотел делать больно тебе
малышка сори не разобрался в себе
по мойму не любил но всегда был любимым
просто *** сильно от твоего внешнего вида

зайка ты поверь это просто подруга
дружба очень близкая ведь мы **** друг друга

нет я не бабник это просто групис
одевайся сучка ведь ты просто нормис
котятки не то чтобы я любитель фурис
но она так рычала и мычала что я тащусь

зачем ты плачешь зай лучше б думала тогда
каждая подруга говорила то что я рэд флаг
ну и все подруги говорили типа я мудак
и не скрыть мне в телефоне номера всех этих баб

зачем ты плачешь зай лучше б думала тогда
каждая подруга говорила то что я рэд флаг
ну и все подруги говорили типа я мудак
и не скрыть мне в телефоне номера всех этих баб

и мне не важно щас с кем ты
и мне не важно зачем ты постишь эти фото в ленту, е-е

лишь набивая клиентов, е-е
и я не буду страдать я хлоднокровен опять, е-е
тебе придётся принять 
я бессердечный мудак и в груди пусто так, е-е
да я рэд флаг 
да я рэд флаг, ха, е """

text_song_RED_FLAG2 = """"зачем ты плачешь зай лучше б думала тогда
каждая подруга говорила то что я рэд флаг
ну и все подруги говорили типа я мудак
и не скрыть мне в телефоне номера всех этих баб

я не хотел делать больно тебе
малышка сори не разобрался в себе
по мойму не любил но всегда был любимым
просто *** сильно от твоего внешнего вида

зайка ты поверь это просто подруга
дружба очень близкая ведь мы **** друг друга

Слушай:
https://band.link/GLILH 
"""

img_RED_FLAG = os.path.join(BASE_DIR, 'files', 'img' , 'red.jpg')

text_song_ARMANI = '''я не плачу за эту суку потому что я **лан и я знаю она dumb и я знаю она в хлам
она лишь моя запаска пусть башляет ее пахан 
просто сейчас сильно хочется * дать ей на клыкан

чел куда ты лезешь ты не знаешь этот город здесь не факайся с районом не вывезешь таких приколов

ара за такие мувы из тебя сделают шашлык 
будешь очень долго плакаать ты как будто бы банши

мы ща с extendo барабаном а ты напрудил в штаны
бл* я будто балабанов но вокруг золото и шик

от меня очень вкусно пахнет сука это GIORGIO ARMANI
тут все знаю это факты что миром правят армяни

никогда царапал киску у меня всегда был свежий маник
ей сильно хочется быть близкой хочет быть со мною рядом
 
не даю ей считать деньги пусть развивает фантазию 
все давай bay я поехал меня ждут дела в Абхазии

мой тайп дэй сейчас тяжелый потому что я на дне
зову это down for life
не вздумай на меня п***ть
на*** шлю я себя прошлого 
он для меня в огне
чтоб оправдать себя не знаю сколько мне надо монет

сука ты чо stupid
у меня на связи милфа она groupi 
да i’m gonna pull up 
будет mass shit
с братом делаем так муллу это trap shit

ты ещё бегал под стол
а я уже слушал gucci mane
сорри i just do my thang
не смотри ты на мой гэнг

правда прости меня братка за то что я сейчас витаю мне просто делают слюнявый и я жестко залипаю

зато твоя бэй п****т тебе типа она фригидна
ну а потом * мне так будто я ** *** в **
'''

text_song_ARMANI2 = '''
мы ща с extendo барабаном а ты напрудил в штаны
бл* я будто балабанов но вокруг золото и шик

от меня очень вкусно пахнет сука это GIORGIO ARMANI
тут все знаю это факты что миром правят армяни

никогда царапал киску у меня всегда был свежий маник
ей сильно хочется быть близкой хочет быть со мною рядом
 
не даю ей считать деньги пусть развивает фантазию 
все давай bay я поехал меня ждут дела в Абхазии

мой тайп дэй сейчас тяжелый потому что я на дне
зову это down for life
не вздумай на меня п***ть
на*** шлю я себя прошлого 
он для меня в огне
чтоб оправдать себя не знаю сколько мне надо монет

'''

img_ARMANI = os.path.join(BASE_DIR, 'files', 'img' , 'ARMANI.jpg')


text_song_BIPOLARKA = """мне на тебя * новая в субботу
на деньги * хаслю на природе
ей со со мной прикольно разноцветные колеса
в попу ей не больно ведь она сейчас под molly

во мне сейчас столько газолина и мне плохо
или очень хорошо пока что я не понял
мама дринкин хенни но этотпрследство боли
радовал ей в рот и я как робчик не виновен

детка закрой глаза
слушай меня сюда
все что говорили про меня это вода
да я биполярен но ведь так было всегда
я разбитый однолюб одна лишь в моих снах 
"""


img_BIPOLARKA = os.path.join(BASE_DIR, 'files', 'img' , 'bipolarka.jpg')

text_song_BREZLIVOST = """я брезгливый человек и мне от вас мерзко у******
в центре города не здороваюсь больше за руку
да я брезгал твою суку в том туалете стрипухи 
а ты дальше верь ей принимая всю лапшу на ухо

но салютую брату правой рукой
к ней больше не ногой
мне не хватит слов чтоб описать вам эту сука боль
манит большой город вновь
сильно давит дом родной
надо выбрать верный путь зависит от него исход 

где же свопер молодой
вновь загналя что с тобой 
ты не знаешь сколько мерзорти 
под всей трэп кожурой

во мне личностей миллион 
но я хочу быть собой
разделить свое музло 
со своей большой толпой

это нормально если больно тебе
ведь тебя ждет успех
главное не тушить это чувство поглощая снег
и мне п***й чо ты скажешь да я босс восьмиэтижнк
мы хасаним как в форсаже
не боись я не промажу
у нас очень много сажи
глаза красные я сварщик
в читке очень много стажа
даже в таком жанре слажен"""

https_release = """ https://band.link/GLILH """


img_BREZGLIVOST = os.path.join(BASE_DIR, 'files', 'img' , 'БРЕЗГЛИВОСТЬ.jpg')



demo_list = {'RED FLAG': text_song_RED_FLAG,'ИНДУСТРИЯ': text_song_INDUSTRIA, 'ARMANI': text_song_ARMANI, 'БИПОЛЯРКА': text_song_BIPOLARKA, 'БРЕЗГЛИВОСТЬ': text_song_BREZLIVOST}
name = 'HOODRICHSWOPER'



count = 1
text_list_demo = ''
for song in demo_list:
    text_list_demo = text_list_demo + f'{count}) {name} - {song}\n'
    count += 1




